{
  "add_cross_attention": false,
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float16",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "read_file",
    "1": "grep_search",
    "2": "list_directory",
    "3": "glob_pattern",
    "4": "edit_file",
    "5": "write_file",
    "6": "apply_patch",
    "7": "run_bash",
    "8": "run_tests",
    "9": "lint_or_typecheck",
    "10": "ask_user",
    "11": "plan_task",
    "12": "web_search",
    "13": "respond_only"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "apply_patch": 6,
    "ask_user": 10,
    "edit_file": 4,
    "glob_pattern": 3,
    "grep_search": 1,
    "lint_or_typecheck": 9,
    "list_directory": 2,
    "plan_task": 11,
    "read_file": 0,
    "respond_only": 13,
    "run_bash": 7,
    "run_tests": 8,
    "web_search": 12,
    "write_file": 5
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.12.1",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 250002
}
