{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float16",
  "eos_token_id": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "apply_patch",
    "1": "ask_user",
    "2": "edit_file",
    "3": "glob_pattern",
    "4": "grep_search",
    "5": "lint_or_typecheck",
    "6": "list_directory",
    "7": "plan_task",
    "8": "read_file",
    "9": "respond_only",
    "10": "run_bash",
    "11": "run_tests",
    "12": "web_search",
    "13": "write_file"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "apply_patch": 0,
    "ask_user": 1,
    "edit_file": 2,
    "glob_pattern": 3,
    "grep_search": 4,
    "lint_or_typecheck": 5,
    "list_directory": 6,
    "plan_task": 7,
    "read_file": 8,
    "respond_only": 9,
    "run_bash": 10,
    "run_tests": 11,
    "web_search": 12,
    "write_file": 13
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.12.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
